tests/auth-regression/mutations/capture-name-filter.patch
diff --git a/src/auth/cookie-session.ts b/src/auth/cookie-session.ts
index 0eb4166..0b5c20f 100644
--- a/src/auth/cookie-session.ts
+++ b/src/auth/cookie-session.ts
@@ -201,7 +201,7 @@ export class CookieSession {
       await this.waitForGate(name, timeoutMs);
 
       const jar = await this.deps.driver.cookieListFromState(name);
-      const payload = filterToGeminiDomains(jar);
+      const payload = filterToGeminiDomains(jar).filter((c) => c.name === PSID_COOKIE_NAME || c.name === PSIDTS_COOKIE_NAME);
       try {
         this.deps.validator.validate(payload);
       } catch (err) {
